/*******************************************************************************
****版本：V1.0.0
****平台：msp430
****日期：2021-05-21
****作者：Qitas
****版权：OS-Q
*******************************************************************************/
#include <msp430g2553.h>

int main(void)
{
    WDTCTL = WDTPW + WDTHOLD;

    // make the LED pin an output for P1.0
    P1DIR |= 0x01;

    volatile int i;

    while (1)
    {
        for (i = 0; i < 10000; i++);

        // toggle the LED
        P1OUT ^= 0x01;
    }

    return 0;
}

/*---------------------------(C) COPYRIGHT 2021 OS-Q -------------------------*/
